УчетВУправляющихДляГит1/src/InformationRegisters/СинхронизацияКлассификаторовВЕТИС/СинхронизацияКлассификаторовВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинхронизацияКлассификаторовВЕТИС</name>
  <resources>
    <name>ДатаСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Смещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипВЕТИС</name>
    <type>
      <types>EnumRef.ТипыВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ТипыВЕТИС/ТипыВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВЕТИС</name>
  <enumValues>
    <name>ХозяйствующиеСубъекты</name>
  </enumValues>
  <enumValues>
    <name>ПредприятияРФ</name>
  </enumValues>
  <enumValues>
    <name>ЗарубежныеПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукции</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>НаименованияПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>НазначенияГрузов</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарноСопроводительныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ЗаписиСкладскогоЖурнала</name>
  </enumValues>
  <enumValues>
    <name>Упаковки</name>
  </enumValues>
  <enumValues>
    <name>СтраныМира</name>
  </enumValues>
  <enumValues>
    <name>Пользователи</name>
  </enumValues>
  <enumValues>
    <name>Заболевания</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/СинхронизацияКлассификаторовВЕТИС/Forms/ФормаЗаписи/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриИзмененииТипаВЕТИС(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриИзмененииТипаВЕТИС(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДатаСинхронизацииПриИзменении(Элемент)
	
	Запись.Смещение = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВЕТИСПриИзменении(Элемент)
	
	ПриИзмененииТипаВЕТИС(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииТипаВЕТИС(Форма)

	Форма.Элементы.Предприятие.Доступность = Форма.Запись.ТипВЕТИС = ПредопределенноеЗначение("Перечисление.ТипыВЕТИС.ЗаписиСкладскогоЖурнала")
		Или Форма.Запись.ТипВЕТИС = ПредопределенноеЗначение("Перечисление.ТипыВЕТИС.ВетеринарноСопроводительныеДокументы");
		
	Если Не Форма.Элементы.Предприятие.Доступность Тогда
		Форма.Элементы.Предприятие.ПодсказкаВвода = НСтр("ru = '<для всех предприятий>'");
		Если ЗначениеЗаполнено(Форма.Запись.Предприятие) Тогда
			Форма.Запись.Предприятие = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.ХозяйствующийСубъект.Доступность = Форма.Запись.ТипВЕТИС = ПредопределенноеЗначение("Перечисление.ТипыВЕТИС.ЗаписиСкладскогоЖурнала")
		Или Форма.Запись.ТипВЕТИС = ПредопределенноеЗначение("Перечисление.ТипыВЕТИС.ВетеринарноСопроводительныеДокументы");
		
	Если Не Форма.Элементы.ХозяйствующийСубъект.Доступность Тогда
		Форма.Элементы.ХозяйствующийСубъект.ПодсказкаВвода = НСтр("ru = '<для всех организаций>'");
		Если ЗначениеЗаполнено(Форма.Запись.Предприятие) Тогда
			Форма.Запись.ХозяйствующийСубъект = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
